#include "Employee.h"
#include <clocale>
int main()
{
	setlocale(0, "Rus");
	Employee arr[5] = { 
        {"Иван", 1950, "Инженер", 50000, "Высшее"},
        {"Пётр", 1965, "Менеджер", 60000, "Среднее"},
        {"Сидор", 2000, "Программист", 70000, "Высшее"},
        {"Фёдор", 1985, "Директор", 80000, "Высшее"},
        {"Михаил", 1970, "Бухгалтер", 55000, "Среднее"} };
    int count = 0;
    for (int i = 0; i < 5; i++)
    {
        arr[i].show();
    }
    cout << "----------------------------------" << endl;
    cout << "Старше 60: " << endl;
    for (int i = 0; i < 5; i++) 
    {
        if (arr[i].isOlderThan60()) 
        {
            arr[i].show();
            count++;
        }
    }
}